# 1)Создать переменную типа String
name = 'Aidar'
x = (name)
print(x)

# 2)Создать переменную типа Int
type_int = 5
print(type_int)
print(type(type_int))

# 3)Создаем переменную типа Flo
type_float = 8.5
print(type_float)
print(type(type_float))

# 4)Создаем переменную Bytes
size = 6
arr = bytes (size)
print(type(arr))

# 5)Создаем переменную List
number_list = [3, 5, 8]
print(number_list)
print(type(number_list))

# 6)Cоздаем переменную Tuples
tuple_1 = (1, 2, 3)
tuple_2 = ( 'hi', 'bay')
tuple_3 = (3, 3.5, 'noumber')
print(type(tuple_1))
print(type(tuple_2))
print(type(tuple_3))

# 7)Создаем переменную Set
set = {'red','orange', 'green', 'dlue'}
print(set)
print(type(set))

# 8)Создаем переменную Frozen set (кортеж и множество)
new = frozenset([5, 9, 7, 8,])
print(type(new))

# 9)Создаем переменную Dict
prices = {'home': 80000, 'plot': 4000}
print(prices['home'])
print(type(prices))

# 10) Создать 2 переменные String, создать переменную в которой суммируете эти переменные.
car='bmw'
car_2='opel'
car_3=car + car_2
print(car_3)

# 11) Создать 2 переменные Integer, создать переменную в которой суммируете эти переменные.
c=1000+6000
d=700-200
v=c+d
print(type(v))

# 12) Создать переменную в которой разделите эти переменныу int
c=25
d=5
v=c/d
print(v)

# 13) Создать переменную в которой умножите эти переменныу int
c=25
d=5
v=c*d
print(v)

# 14) Создать переменную в которой Разделите без остатка эти переменные Int.
c=25
d=6
v=c//d
print(v)

# 15) Создать переменную в которой надо присвоить остаток от деления этих переменные Int.
c=25
d=6
v=c/d
print(v)


